a, b, c = int(input("Коэфицент a: ")), int(input("Коэфицент b: ")), int(input("Коэфицент c: "))

d = b ** 2 - 4 * a * c

if d > 0:
    print(f'Дискриминант равен {d} => существуют два корня')
    x1 = -b + d ** 0,5 / 2 * a 
    ## x1 = -b + d ** 0,5 / 2 * a
    x2 = -b - d ** 0,5 / 2 * a
    print('x1 = ', x1, 'x2 = ', x2)
if d == 0:
    print((f'Дискриминант равен {d} => существует лишь один корень'))
    print('x = ', - b  / 2 ** a)
if d < 0:
    print(f'Дискриминант равен {d} => нет корней(')